import asyncio
import os

import aiogram.utils.exceptions as exc
import psycopg2
from aiogram.bot.bot import Bot

##############
# КОНФИГ:
API_TOKEN = os.getenv('BOT_TOKEN')
if not API_TOKEN:
    print('токена нет')
    exit(-1)

DATABASE_URL = os.getenv('DATABASE_URL')
if not DATABASE_URL:
    print('урла бд нет')
    exit(-1)
##############

##############
# БД
try:
    db = psycopg2.connect(DATABASE_URL, sslmode='require')
except Exception:
    db = None
    print('урла бд нет')
    exit(-1)

cursor = db.cursor()


def pre_process():
    full_names = dict()
    users_id = []

    # тащим все айдишники из бд:
    cursor.execute("SELECT id from users")
    for i in cursor.fetchall():
        users_id.append(i[0])

    # создаем БД:
    cursor.execute("CREATE TABLE IF NOT EXISTS users(id BIGINT PRIMARY KEY, username TEXT, first_name TEXT, "
                   "last_name TEXT, full_name TEXT, join_date TIMESTAMP, messages INTEGER)")

    cursor.execute("CREATE TABLE IF NOT EXISTS messages(id BIGINT PRIMARY KEY, songs_ INTEGER, contacts_ INTEGER, "
                   "howto_ INTEGER, team_ INTEGER, memes_ INTEGER, credits_ INTEGER, help_ INTEGER, start_ INTEGER,"
                   "stop_ INTEGER, santa_ INTEGER, end_ INTEGER)")
    db.commit()

    ##############

    async def get_tg_names():
        b = Bot(token=API_TOKEN)
        for j in users_id:
            try:
                p = await b.get_chat_member(chat_id=-1001761177569, user_id=j)
            except exc.BadRequest:
                print('fail', j)
                continue
            full_names[p.user.id] = tuple(p.user.full_name.split())
        return

    loop = asyncio.get_event_loop()
    loop.run_until_complete(get_tg_names())
    loop.close()

    print(users_id)
    print(full_names)


FULL_NAMES = {1306294714: ('~твоя', 'мерзость.'), 912515292: ('Арсений',), 1202704228: ('Екатерина', 'Гребёнкина'),
              626301983: ('Александра',), 418107034: ('Кирилл', 'Кругликов'), 1242612463: ('kerauverk',),
              1827430974: ('nikki', 'vskrto'), 763718623: ("G'ayrat",), 1028047493: ('Маруся', 'Дощечкина'),
              984835432: ('🤍thevalery🤍',), 750857380: ('Sasha',), 859499774: ('barkosser',), 949449595: ('🐿️',),
              915293518: ('Arisha', 'Kopylova'), 604181224: ('Матвей', 'Янголенко'),
              1839290151: ('Allergic to', 'People'), 1038986109: ('Анна', 'Ланских'),
              830920118: ('Aleksandr', 'Lopatko'), 684785002: ('Lena', 'D'), 1814854497: ('Алина☃️',),
              1339387850: ('Софья', 'Пошукайло'), 1298918427: ('Катя', 'Боева'), 808864993: ('Ксения', 'Клюева'),
              421770409: ('Аполлинария',), 1371458078: ('Ира',), 1167059277: ('Evgeha',), 476337160: ('Роман', 'Комов'),
              925184312: ('Rish',), 713815827: ('гриша', 'алфёров'), 1276954403: ('Никошка',),
              966452026: ('ullccceey',), 1180071373: ('irasubbotina_',), 886155515: ('Karina',),
              1044869530: ('Максим',), 1120695506: ('Дима',), 824548117: ('Даша',), 744431052: ('Анчоус', '🥸'),
              1636551595: ('Lolita',), 1535110493: ('Зубкова', 'Полина'), 800957236: ('Яна', 'Лукина'),
              1652732836: ('Рената',), 1554349219: ('Huge', 'Cat'), 1866809913: ('ксюша', 'хлопова'),
              735035167: ('Polina', 'Nosevich'), 895841296: ('Voytenko',), 941543842: ('Pyankova', 'Polina'),
              1511045033: ('слава🤙',), 992489503: ('Kristina', '•••'), 1503877841: ('Алиса',), 746600084: ('Matias',),
              1319044289: ('Юля', 'Арбузова'), 827835673: ('Диана', 'Полянская'), 1903810166: ('gay',),
              811742362: ('Карина',), 972919938: ('Валерия', 'Гукова'), 524027591: ('Antonina',),
              1007940091: ('Александра Кузьменко', '🤍'), 670243686: ('🕊',), 1353175923: ('Анастасия', 'Сеничкина'),
              888661591: ('Katrine',), 2128827002: ('Кристина', 'makhoyni'), 970537793: ('Alina',),
              408444942: ('Peter', 'Lagutin'), 858518428: ('☄ Asmodeus', '🔱'), 911640801: ('Anna', 'Klimenteva'),
              750119071: ('Anastasia', 'Millagher'), 1112547975: ('Даниил', 'Бердышев'),
              1299812194: ('Катя', 'Сидорова'), 1329049699: ('valerolll',), 293182379: ('Svetlana',),
              1740178046: ('Екатерина', 'Боева'), 625991372: ('Денис', 'Бирюков'), 1399973118: ('Rrincess', 'Bich'),
              1424975200: ('Биз',), 597583721: ('Phoenix’s',), 324242509: ('Арсений', 'Бирюков'),
              575120780: ('ковальская-дефолтова',), 608316796: ('s o s',), 1832602820: ('анна', 'семыкина'),
              1711263832: ('ᯓ 𝑫𝑪 | 7𝗢𝗗𝗔✹ ⃝⃙🇲🇽',), 920248300: ('марияр',), 1037353382: ('даша', 'про'),
              499606837: ('Ylik', 'Zver🖇'), 175044465: ('Ioann', 'Chas'), 385056286: ('Dan', 'Sazonov'),
              407274643: ('Usman', 'Mughal'), 424185494: ('Vladislav', 'Kozub'), 1125531055: ('Михаил', 'Лобынцев'),
              1070984836: ('Darya', 'Sergeevna'), 843464775: ('𝒦ℴ𝓉', 'ℳ𝒶𝓉𝓇ℴ𝓈𝓀𝒾𝓃😡ツ✘'),
              1854799789: ('NVSPC', 'ADMIN'), 913289451: ('Baxora',), 500861553: ('M.M.M',),
              422419401: ('Stepan', 'Ikonnikov'), 439481645: ('.',), 622051454: ('Аленка', 'Токсик'),
              726058532: ('leramalyy',), 1399417506: ('Кира',)}
IDS = [1306294714, 912515292, 24, 1202704228, 626301983, 418107034, 1242612463, 1827430974, 763718623, 1028047493,
       984835432, 750857380, 859499774, 949449595, 915293518, 604181224, 1839290151, 1038986109, 830920118, 684785002,
       1814854497, 1339387850, 1298918427, 808864993, 421770409, 1371458078, 1167059277, 476337160, 925184312,
       713815827, 1276954403, 966452026, 1180071373, 886155515, 1044869530, 1120695506, 824548117, 744431052,
       1636551595, 1535110493, 800957236, 1652732836, 1554349219, 1866809913, 735035167, 895841296, 941543842,
       1511045033, 992489503, 1503877841, 746600084, 1319044289, 827835673, 1903810166, 811742362, 972919938, 524027591,
       1007940091, 670243686, 1353175923, 888661591, 2128827002, 970537793, 408444942, 858518428, 911640801, 750119071,
       1112547975, 1299812194, 1329049699, 293182379, 1740178046, 625991372, 1399973118, 1424975200, 597583721,
       324242509, 575120780, 608316796, 1832602820, 1711263832, 920248300, 1037353382, 499606837, 175044465, 385056286,
       407274643, 424185494, 1125531055, 1070984836, 843464775, 1854799789, 913289451, 500861553, 422419401, 439481645,
       622051454, 726058532, 1399417506]
NAMES = {1038986109: 'Ланских Анна Валерьевна', 830920118: 'Лопатко Александр Игоревич',
         713815827: 'Алфёров Григорий Александрович', 175044465: 'Часовских Иван Александрович',
         992489503: 'Агибалова Кристина Станиславовна', 1298918427: 'Боева Екатерина Петровна',
         744431052: 'Казимирик Анна Дмитриевна', 735035167: 'Носевич Полина Петровна',
         1353175923: 'Сеничкина Анастасия  Александровна', 824548117: 'Шашкова Дарья Юрьевна',
         941543842: 'Пьянкова Полина Андреевна', 1167059277: 'Мартыновой Евгении  Юрьевны',
         1652732836: 'Камбарова Рената Наильевна', 1636551595: 'Подшибякина Лолита Николаевна',
         920248300: 'Ефремова Мария Романовна', 499606837: 'Зверева Юлия Евгеньевна',
         1503877841: 'Сасина Алиса Игоревна', 684785002: 'Дьячкова Елена Михайловна',
         726058532: 'Малыхина Валерия Юрьевна', 1070984836: 'Баулина Дарья Сергеевна',
         1007940091: 'Кузьменко Александра Александровна', 670243686: 'Галич Ксения Сергеевна',
         421770409: 'Смольянинова Полина Олеговна', 1044869530: 'Матвеев Максим Александрович',
         886155515: 'Костина Карина Романовна', 800957236: 'Лукина Яна Евгеньевна',
         1112547975: 'Бердышев Даниил Игоревич', 895841296: 'Войтенко Владислав Андреевич',
         1180071373: 'Субботина Ирина Борисовна', 1120695506: 'Водолад Дмитрий Владиславович',
         1399973118: 'Макаревич Ирина Сергеевна', 827835673: 'Полянская Диана Сергеевна',
         1554349219: 'Гонеев Михаил Сергеевич', 972919938: 'Гукова Валерия Викторовна',
         970537793: 'Таранова Алина Александровна', 911640801: 'Климентьева Анна Дмитриевна',
         750119071: 'Тарасова Анастасия Владимировна', 1299812194: 'Сидорова Екатерина Евгеньевна',
         622051454: 'Бражникова Елена Александровна', 1814854497: 'Борзенкова Алина Сергеевна',
         1371458078: 'Сафатова Ирина Витальевна', 625991372: 'Бирюков Денис Александрович',
         808864993: 'Клюева Ксения Ивановна', 1511045033: 'Солнцева Ярославла Андреевна',
         811742362: 'Макарьева Карина Алексеевна', 1329049699: 'Шевлякова Валерия Сергеевна',
         1740178046: 'Боева Екатерина Владимировна', 385056286: 'Сазонов Даниил Александрович'}

USERS_DB = [['1306294714', 'Ebanashk', '~твоя', 'мерзость.', '', '2021-11-27 19:19:26.942622', '17'],
            ['912515292', '', 'Арсений', '', '', '2021-11-27 10:43:41.715877', '2'],
            ['1202704228', '', 'Екатерина', 'Гребёнкина', '', '2021-11-27 11:39:18.280198', '5'],
            ['626301983', 'aabuldakova', 'Александра', '', '', '2021-11-27 09:59:04.848413', '2'],
            ['418107034', 'kirkruglikov', 'Кирилл', 'Кругликов', '', '2021-11-27 10:00:49.571187', '4'],
            ['1242612463', 'Shhiiiiiiiiitttt', 'kerauverk', '', '', '2021-11-27 19:21:40.327223', '2'],
            ['1827430974', '', 'nikki', 'vskrto', '', '2021-11-27 10:09:06.691582', '1'],
            ['763718623', 'qurbonov_gayrat', "G'ayrat", '', '', '2021-11-27 16:17:18.611614', '6'],
            ['1028047493', 'shittt2', 'Маруся', 'Дощечкина', '', '2021-11-27 20:39:57.330069', '4'],
            ['984835432', 'thevalllery', '🤍thevalery🤍', '', '', '2021-11-27 10:10:57.890785', '9'],
            ['750857380', 'sandra1089', 'Sasha', '', '', '2021-11-27 10:13:20.843484', '1'],
            ['859499774', 'barkosser', 'barkosser', '', '', '2021-11-27 16:45:40.565667', '4'],
            ['949449595', 'tylox01', '🐿️', '', '', '2021-11-27 21:04:05.761865', '2'],
            ['915293518', 'arishkaw', 'Arisha', 'Kopylova', '', '2021-11-30 17:45:24.704257', '7'],
            ['604181224', '', 'Матвей', 'Янголенко', '', '2021-11-27 22:45:09.202871', '12'],
            ['1839290151', 'allewgictopeople', 'Allergic to', 'People', '', '2021-11-30 20:13:19.01066', '6'],
            ['1038986109', '', 'Анна', 'Ланских', 'Ланских Анна Валерьевна', '2021-11-27 07:35:12.200982', '22'],
            ['830920118', 'alexselfish46', 'Aleksandr', 'Lopatko', 'Лопатко Александр Игоревич',
             '2021-12-01 09:13:12.339342', '2'],
            ['684785002', '', 'Lena', 'D', 'Дьячкова Елена Михайловна', '2021-12-02 05:50:05.492052', '3'],
            ['1814854497', '', 'Алина☃️', '', 'Борзенкова Алина Сергеевна', '2021-12-02 13:22:44.711041', '5'],
            ['1339387850', 'mathfightsyandexru', 'Софья', 'Пошукайло', '', '2021-12-02 11:34:07.783279', '1'],
            ['1298918427', '', 'Катя', 'Боева', 'Боева Екатерина Петровна', '2021-12-01 11:45:16.309043', '2'],
            ['808864993', 'kseniaklyueva', 'Ксения', 'Клюева', 'Клюева Ксения Ивановна', '2021-12-07 12:19:46.647992',
             '2'], ['421770409', 'aloapollinaria', 'Аполлинария', '', 'Смольянинова Полина Олеговна',
                    '2021-11-27 07:37:32.470532', '10'],
            ['1371458078', 'Not_puppy', 'Ира', '', 'Сафатова Ирина Витальевна', '2021-12-07 12:08:31.477937', '2'],
            ['1167059277', '', 'Evgeha', '', 'Мартыновой Евгении  Юрьевны', '2021-11-27 10:30:23.544116', '8'],
            ['476337160', '', 'Роман', 'Комов', '', '2021-11-27 19:12:37.598191', '8'],
            ['925184312', 'rishbaranova', 'Rish', '', '', '2021-12-02 19:21:52.098907', '21'],
            ['713815827', '', 'гриша', 'алфёров', 'Алфёров Григорий Александрович', '2021-12-01 09:40:34.279403', '4'],
            ['1276954403', '', 'Никошка', '', '', '2021-12-07 12:29:49.496953', '2'],
            ['966452026', 'katiamish', 'ullccceey', '', '', '2021-12-02 15:29:55.747831', '2'],
            ['1180071373', '', 'irasubbotina_', '', 'Субботина Ирина Борисовна', '2021-11-27 10:22:48.798628', '2'],
            ['886155515', '', 'Karina', '', 'Костина Карина Романовна', '2021-12-02 15:36:55.574435', '2'],
            ['1044869530', '', 'Максим', '', 'Матвеев Максим Александрович', '2021-11-27 10:03:22.602045', '4'],
            ['1120695506', '', 'Дима', '', 'Водолад Дмитрий Владиславович', '2021-12-02 15:37:20.316373', '2'],
            ['824548117', '', 'Даша', '', 'Шашкова Дарья Юрьевна', '2021-12-01 17:27:12.544142', '30'],
            ['744431052', 'tikitopersha', 'Анчоус', '🥸', 'Казимирик Анна Дмитриевна', '2021-11-27 09:58:23.408949',
             '5'],
            ['1636551595', '', 'Lolita', '', 'Подшибякина Лолита Николаевна', '2021-12-01 12:09:43.513659', '12'],
            ['1535110493', 'polina_egf23', 'Зубкова', 'Полина', '', '2021-12-01 17:52:23.941582', '2'],
            ['800957236', 'yanchous_lu', 'Яна', 'Лукина', 'Лукина Яна Евгеньевна', '2021-12-02 15:37:28.643323', '2'],
            ['1652732836', '', 'Рената', '', 'Камбарова Рената Наильевна', '2021-12-01 18:13:11.888134', '2'],
            ['1554349219', 'Huge_Cat_exe', 'Huge', 'Cat', 'Гонеев Михаил Сергеевич', '2021-11-27 17:52:53.345361',
             '19'], ['1866809913', '', 'ксюша', 'хлопова', '', '2021-12-01 14:09:23.925065', '23'],
            ['735035167', '', 'Polina', 'Nosevich', 'Носевич Полина Петровна', '2021-11-27 10:26:06.869376', '2'],
            ['895841296', 'vo1ten', 'Voytenko', '', 'Войтенко Владислав Андреевич', '2021-12-02 15:37:52.861928', '2'],
            ['941543842', 'ppyankova8', 'Pyankova', 'Polina', 'Пьянкова Полина Андреевна', '2021-12-01 17:26:13.322228',
             '2'],
            ['1511045033', 'voruvv1', 'слава🤙', '', 'Солнцева Ярославла Андреевна', '2021-12-02 09:22:38.906726', '4'],
            ['992489503', '', 'Kristina', '•••', 'Агибалова Кристина Станиславовна', '2021-11-27 22:03:18.083442', '6'],
            ['1503877841', '', 'Алиса', '', 'Сасина Алиса Игоревна', '2021-12-01 20:20:59.840287', '2'],
            ['746600084', 'Totehemolo', 'Matias', '', '', '2021-12-01 21:15:28.412057', '2'],
            ['1319044289', '', 'Юля', 'Арбузова', '', '2021-11-28 09:34:27.398684', '2'],
            ['827835673', 'diasha_mn', 'Диана', 'Полянская', 'Полянская Диана Сергеевна', '2021-12-02 16:48:55.218924',
             '2'], ['1903810166', '', 'gay', '', '', '2021-12-02 04:07:57.820538', '3'],
            ['811742362', 'karinamkr', 'Карина', '', 'Макарьева Карина Алексеевна', '2021-11-27 10:55:30.494021', '4'],
            ['972919938', 'Lerochekcheese', 'Валерия', 'Гукова', 'Гукова Валерия Викторовна',
             '2021-12-03 00:14:42.046216', '4'],
            ['524027591', 'sssshhhhhiiiiiiittttt', 'Antonina', '', '', '2021-12-07 17:56:38.676106', '2'],
            ['1007940091', 'me_kuzmenko', 'Александра Кузьменко', '🤍', 'Кузьменко Александра Александровна',
             '2021-12-02 07:35:45.712582', '2'],
            ['670243686', 'kkseni_ks', '🕊', '', 'Галич Ксения Сергеевна', '2021-12-02 07:37:31.801986', '2'],
            ['1353175923', 'Anastasitit', 'Анастасия', 'Сеничкина', 'Сеничкина Анастасия  Александровна',
             '2021-12-01 17:14:19.774558', '6'],
            ['888661591', 'Avi_katriin', 'Katrine', '', '', '2021-12-07 18:00:55.0625', '2'],
            ['2128827002', '', 'Кристина', 'makhoyni', '', '2021-12-02 08:28:33.431996', '2'],
            ['970537793', '', 'Alina', '', 'Таранова Алина Александровна', '2021-12-04 20:45:26.804863', '42'],
            ['408444942', 'peterlagutin', 'Peter', 'Lagutin', '', '2021-12-08 18:54:22.258548', '1'],
            ['858518428', 'so_golden_28', '☄ Asmodeus', '🔱', '', '2021-12-07 18:18:53.646889', '4'],
            ['911640801', '', 'Anna', 'Klimenteva', 'Климентьева Анна Дмитриевна', '2021-11-27 18:11:32.030682', '11'],
            ['750119071', 'millagher', 'Anastasia', 'Millagher', 'Тарасова Анастасия Владимировна',
             '2021-12-04 16:16:13.025165', '4'],
            ['1112547975', 'DadyaDaniil', 'Даниил', 'Бердышев', 'Бердышев Даниил Игоревич', '2021-12-02 08:40:03.86074',
             '13'], ['1299812194', 'kAtyAAAaas', 'Катя', 'Сидорова', 'Сидорова Екатерина Евгеньевна',
                     '2021-12-05 10:17:34.470627', '2'],
            ['1329049699', '', 'valerolll', '', 'Шевлякова Валерия Сергеевна', '2021-12-07 18:23:16.274819', '2'],
            ['293182379', 'Svetlya4_ok', 'Svetlana', '', '', '2021-11-27 12:28:13.466774', '2'],
            ['1740178046', '', 'Екатерина', 'Боева', 'Боева Екатерина Владимировна', '2021-11-27 04:04:45.846036',
             '15'],
            ['625991372', '', 'Денис', 'Бирюков', 'Бирюков Денис Александрович', '2021-11-27 10:03:32.090233', '34'],
            ['1399973118', '', 'Rrincess', 'Bich', 'Макаревич Ирина Сергеевна', '2021-12-02 19:16:52.101467', '11'],
            ['1424975200', 'Azizbek_Shavkatovich', 'Биз', '', '', '2021-12-13 04:09:05.943708', '1'],
            ['597583721', 'olgoritms', 'Phoenix’s', '', '', '2021-12-09 17:15:05.921802', '1'],
            ['324242509', 'arseniy_biryukov', 'Арсений', 'Бирюков', '', '2021-11-28 17:00:57.138863', '5'],
            ['575120780', 'u_kovaldefolt', 'ковальская-дефолтова', '', '', '2021-12-09 11:40:28.44606', '6'],
            ['608316796', 'iammjulia', 's o s', '', '', '2021-12-12 11:23:58.201242', '5'],
            ['1832602820', '', 'анна', 'семыкина', '', '2021-11-27 18:06:33.040903', '3'],
            ['1711263832', 'STTT_4', 'ᯓ 𝑫𝑪 | 7𝗢𝗗𝗔✹ ⃝⃙🇲🇽', '', '', '2022-02-09 04:36:57.763621', '2'],
            ['920248300', '', 'марияр', '', 'Ефремова Мария Романовна', '2021-12-01 19:45:37.741397', '29'],
            ['1037353382', 'lookwhatshed1d', 'даша', 'про', '', '2021-12-12 11:25:42.386234', '12'],
            ['499606837', 'Corzm13_18', 'Ylik', 'Zver🖇', 'Зверева Юлия Евгеньевна', '2021-12-01 20:45:16.855275', '4'],
            ['175044465', 'Van_che', 'Ioann', 'Chas', 'Часовских Иван Александрович', '2021-12-01 09:44:43.286009',
             '7'], ['407274643', 'usmanmughal', 'Usman', 'Mughal', '', '2022-01-03 04:24:53.093739', '4'],
            ['424185494', 'vykozub', 'Vladislav', 'Kozub', '', '2021-12-16 17:00:33.413294', '6'],
            ['1125531055', 'helloiameurofan', 'Михаил', 'Лобынцев', '', '2021-11-27 09:28:12.375826', '9'],
            ['1070984836', '', 'Darya', 'Sergeevna', 'Баулина Дарья Сергеевна', '2021-11-27 07:51:07.995262', '17'],
            ['843464775', 'mishkaSao', '𝒦ℴ𝓉', 'ℳ𝒶𝓉𝓇ℴ𝓈𝓀𝒾𝓃😡ツ✘', '', '2021-12-16 19:43:46.702538', '7'],
            ['1854799789', 'nvspc_admin', 'NVSPC', 'ADMIN', '', '2022-01-18 23:58:17.259089', '1'],
            ['913289451', 'baxor1989', 'Baxora', '', '', '2022-01-21 11:26:40.730289', '1'],
            ['500861553', '', 'M.M.M', '', '', '2022-01-26 16:04:55.247005', '1'],
            ['422419401', 'vokinoki', 'Stepan', 'Ikonnikov', '', '2021-11-29 08:11:24.262752', '3'],
            ['439481645', 'hdddkarina', '.', '', '', '2021-11-27 09:58:25.689976', '10'],
            ['622051454', 'Alenkabrazhka', 'Аленка', 'Токсик', 'Бражникова Елена Александровна',
             '2021-11-27 10:16:03.949069', '7'],
            ['726058532', 'leramalyy', 'leramalyy', '', 'Малыхина Валерия Юрьевна', '2021-12-07 18:07:03.927594', '56'],
            ['1399417506', 'Kira_0014', 'Кира', '', '', '2021-12-24 17:46:52.349973', '1'],
            ['385056286', 'dan_sazonov', 'Dan', 'Sazonov', 'Сазонов Даниил Александрович', '2021-11-30 02:46:12.557701',
             '192']]

MESSAGES_DB = [[1038986109, 1, 1, 2, 2, 2, 3, 1, 1, 0, 2, 0, 0], [830920118, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [941543842, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [1276954403, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [1007940091, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [1298918427, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [670243686, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [476337160, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0],
               [1511045033, 0, 0, 0, 0, 0, 0, 0, 1, 0, 2, 1, 0], [811742362, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0],
               [713815827, 0, 0, 0, 1, 0, 0, 0, 1, 0, 2, 0, 0], [2128827002, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [387512211, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0], [911640801, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0],
               [750119071, 0, 0, 0, 0, 2, 0, 0, 1, 0, 1, 0, 0], [1112547975, 1, 0, 0, 0, 9, 1, 0, 1, 0, 1, 0, 0],
               [1299812194, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [524027591, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [1339387850, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0], [293182379, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
               [421770409, 0, 0, 0, 0, 0, 1, 1, 0, 0, 2, 0, 0], [824548117, 0, 0, 0, 0, 27, 0, 1, 1, 0, 1, 0, 0],
               [744431052, 0, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0], [1866809913, 1, 1, 0, 1, 17, 1, 0, 1, 0, 1, 0, 0],
               [735035167, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0], [1167059277, 0, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0],
               [1535110493, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [1652732836, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [1636551595, 0, 0, 0, 0, 9, 1, 0, 1, 0, 1, 0, 0], [888661591, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [1503877841, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [746600084, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [966452026, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [1903810166, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0],
               [684785002, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [625991372, 0, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0],
               [1180071373, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0], [886155515, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [1814854497, 0, 0, 0, 0, 0, 1, 1, 1, 0, 2, 0, 0], [1044869530, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
               [1120695506, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [925184312, 1, 0, 1, 0, 17, 0, 1, 1, 0, 0, 0, 0],
               [800957236, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [895841296, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [992489503, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0], [1353175923, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0],
               [827835673, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [970537793, 1, 0, 0, 1, 37, 1, 0, 1, 0, 1, 0, 0],
               [1554349219, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [1319044289, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0],
               [972919938, 0, 0, 0, 0, 0, 0, 1, 1, 0, 2, 0, 0], [858518428, 0, 0, 0, 0, 0, 0, 0, 1, 0, 2, 1, 0],
               [1329049699, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [1740178046, 0, 0, 0, 0, 0, 1, 0, 0, 0, 3, 1, 0],
               [808864993, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0], [1371458078, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0],
               [408444942, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0], [608316796, 0, 0, 0, 0, 4, 0, 0, 1, 0, 0, 0, 0],
               [1399973118, 0, 3, 0, 1, 0, 2, 2, 1, 0, 2, 0, 0], [1424975200, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
               [597583721, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0], [324242509, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
               [575120780, 0, 0, 0, 1, 4, 0, 0, 1, 0, 0, 0, 0], [726058532, 0, 1, 1, 1, 47, 0, 1, 1, 0, 3, 1, 0],
               [843464775, 1, 1, 0, 1, 2, 1, 0, 1, 0, 0, 0, 0], [1399417506, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
               [407274643, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0], [1037353382, 0, 0, 0, 0, 11, 0, 0, 1, 0, 0, 0, 0],
               [622051454, 0, 0, 0, 1, 0, 1, 0, 0, 0, 2, 1, 0], [499606837, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0],
               [1832602820, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0], [385056286, 8, 6, 3, 7, 14, 20, 48, 4, 0, 9, 6, 0],
               [1070984836, 0, 0, 0, 1, 4, 3, 1, 0, 0, 2, 1, 0], [424185494, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0],
               [1854799789, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0], [913289451, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
               [920248300, 1, 0, 0, 1, 23, 2, 0, 1, 0, 1, 0, 0], [175044465, 0, 0, 0, 2, 2, 1, 0, 1, 0, 1, 0, 0],
               [1125531055, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0], [500861553, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
               [422419401, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0], [439481645, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0],
               [1711263832, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0]]


def process():
    # # создаем бд
    # cursor.execute("CREATE TABLE IF NOT EXISTS users(id BIGINT PRIMARY KEY, username TEXT, first_name TEXT, "
    #                "last_name TEXT, full_name TEXT, join_date TIMESTAMP, messages INTEGER)")
    #
    # cursor.execute("CREATE TABLE IF NOT EXISTS messages(id BIGINT PRIMARY KEY, songs_ INTEGER, contacts_ INTEGER, "
    #                "howto_ INTEGER, team_ INTEGER, memes_ INTEGER, credits_ INTEGER, help_ INTEGER, start_ INTEGER,"
    #                "stop_ INTEGER, santa_ INTEGER, end_ INTEGER, valentine_ INTEGER)")
    # db.commit()

    users_write = []
    # ans = dict()
    # with open('santa_backup.csv', encoding='utf8') as f:
    #     for i in (f.readlines()[1:]):
    #         row = i.split(',')
    #         ans[int(row[0])] = row[1].rstrip('\n')
    # print(ans)
    # with open('users_backup.csv') as f:
    #     ans = []
    #     for i in (f.readlines()[1:]):
    #         row = i.split(',')
    #         names = list(FULL_NAMES[int(row[0])]) if len(FULL_NAMES[int(row[0])]) == 2 else list(
    #             FULL_NAMES[int(row[0])]) + ['']
    #         try:
    #             name = [NAMES[int(row[0])]]
    #         except:
    #             name = ['']
    #         row = row[0:2] + names + name + row[2:-1] + [row[-1].strip('\n')]
    #         ans.append(row)
    # print(ans)
    # ans = []
    # with open('messages_backup.csv') as f:
    #     for i in (f.readlines()[1:]):
    #         row = i.split(',')
    #         row = list(map(int, row[:-1])) + [int(row[-1].strip('\n'))] + [0]
    #         ans.append(row)
    # print(ans)


process()
def migration():
    # создаем бд
    cursor.execute("CREATE TABLE IF NOT EXISTS users(id BIGINT PRIMARY KEY, username TEXT, first_name TEXT, "
                   "last_name TEXT, full_name TEXT, join_date TIMESTAMP, messages INTEGER)")

    cursor.execute("CREATE TABLE IF NOT EXISTS messages(id BIGINT PRIMARY KEY, songs_ INTEGER, contacts_ INTEGER, "
                   "howto_ INTEGER, team_ INTEGER, memes_ INTEGER, credits_ INTEGER, help_ INTEGER, start_ INTEGER,"
                   "stop_ INTEGER, santa_ INTEGER, end_ INTEGER, valentine_ INTEGER)")
    db.commit()

    # переносим users

    for i in USERS_DB:
        try:
            cursor.execute("INSERT INTO users(id, username, first_name, last_name, full_name, join_date, messages)"
                           "VALUES (%s, %s, %s, %s, %s, %s, %s)", tuple(i))
        except:
            print(i)
            exit()
        db.commit()

    # for j in MESSAGES_DB:
    #     cursor.execute("INSERT INTO messages(id, songs_, contacts_, howto_, team_, memes_, credits_, help_,"
    #                    "start_, stop_, santa_, end_, valentine_) "
    #                    "VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)", tuple(j))
    #     db.commit()


migration()
