"""
Фичи общего назначения, которые не получилось запихнуть в другие файлы
"""

import os
import random
from collections import deque

import psycopg2

import config
import logger

log = logger.get_logger(__name__)


def get_memes() -> str:
    """
    Возвращает путь к рандомному мемасу из заранее отобранных, или пустую строку, если мемы не найдены

    :return: путь к пикче или пустая строка
    """
    if os.path.exists('./memes'):
        memes = list(filter(lambda x: x.endswith('.jpg'), os.listdir('./memes')))
    else:
        log.warning("Directory with memes (expected ./memes/) wasn't found")
        return ''

    if os.path.exists('./logs/log_memes.txt'):
        with open('./logs/log_memes.txt', 'r') as f:
            [last_meme] = deque(f, maxlen=1) or ['']
    else:
        last_meme = 0

    while True:
        output = random.choice(memes)
        if output != last_meme:
            with open('./logs/log_memes.txt', 'w+') as f:
                f.write(output)
            break

    return os.path.join('./memes', output)


def get_username(link: str) -> str:
    if link.startswith('@'):
        return link
    if link.startswith('http') or link.startswith('t.me'):
        return f'@{link.split("/")[-1]}'
    return ''


def find_users(name: str):
    full_names = {'Ланских Анна Валерьевна': 1038986109, 'Лопатко Александр Игоревич': 830920118,
                  'Дьячкова Елена Михайловна': 684785002, 'Борзенкова Алина Сергеевна': 1814854497,
                  'Боева Екатерина Петровна': 1298918427, 'Клюева Ксения Ивановна': 808864993,
                  'Смольянинова Полина Олеговна': 421770409, 'Сафатова Ирина Витальевна': 1371458078,
                  'Мартыновой Евгении  Юрьевны': 1167059277, 'Алфёров Григорий Александрович': 713815827,
                  'Субботина Ирина Борисовна': 1180071373, 'Костина Карина Романовна': 886155515,
                  'Матвеев Максим Александрович': 1044869530, 'Водолад Дмитрий Владиславович': 1120695506,
                  'Шашкова Дарья Юрьевна': 824548117, 'Казимирик Анна Дмитриевна': 744431052,
                  'Подшибякина Лолита Николаевна': 1636551595, 'Лукина Яна Евгеньевна': 800957236,
                  'Камбарова Рената Наильевна': 1652732836, 'Гонеев Михаил Сергеевич': 1554349219,
                  'Носевич Полина Петровна': 735035167, 'Войтенко Владислав Андреевич': 895841296,
                  'Пьянкова Полина Андреевна': 941543842, 'Солнцева Ярославла Андреевна': 1511045033,
                  'Агибалова Кристина Станиславовна': 992489503, 'Сасина Алиса Игоревна': 1503877841,
                  'Полянская Диана Сергеевна': 827835673, 'Макарьева Карина Алексеевна': 811742362,
                  'Гукова Валерия Викторовна': 972919938, 'Кузьменко Александра Александровна': 1007940091,
                  'Галич Ксения Сергеевна': 670243686, 'Сеничкина Анастасия  Александровна': 1353175923,
                  'Таранова Алина Александровна': 970537793, 'Климентьева Анна Дмитриевна': 911640801,
                  'Тарасова Анастасия Владимировна': 750119071, 'Бердышев Даниил Игоревич': 1112547975,
                  'Сидорова Екатерина Евгеньевна': 1299812194, 'Шевлякова Валерия Сергеевна': 1329049699,
                  'Боева Екатерина Владимировна': 1740178046, 'Бирюков Денис Александрович': 625991372,
                  'Макаревич Ирина Сергеевна': 1399973118, 'Ефремова Мария Романовна': 920248300,
                  'Зверева Юлия Евгеньевна': 499606837, 'Часовских Иван Александрович': 175044465,
                  'Баулина Дарья Сергеевна': 1070984836, 'Бражникова Елена Александровна': 622051454,
                  'Малыхина Валерия Юрьевна': 726058532, 'Сазонов Даниил Александрович': 385056286}
    tg_names = {'~твоя мерзость.': 1306294714, 'Арсений': 912515292, 'Екатерина Гребёнкина': 1202704228,
                'Александра': 626301983, 'Кирилл Кругликов': 418107034, 'kerauverk': 1242612463,
                'nikki vskrto': 1827430974, "G'ayrat": 763718623, 'Маруся Дощечкина': 1028047493,
                '🤍thevalery🤍': 984835432, 'Sasha': 750857380, 'barkosser': 859499774, '🐿️': 949449595,
                'Arisha Kopylova': 915293518, 'Матвей Янголенко': 604181224, 'Allergic to People': 1839290151,
                'Анна Ланских': 1038986109, 'Aleksandr Lopatko': 830920118, 'Lena D': 684785002, 'Алина☃️': 1814854497,
                'Софья Пошукайло': 1339387850, 'Катя Боева': 1298918427, 'Ксения Клюева': 808864993,
                'Аполлинария': 421770409, 'Ира': 1371458078, 'Evgeha': 1167059277, 'Роман Комов': 476337160,
                'Rish': 925184312, 'гриша алфёров': 713815827, 'Никошка': 1276954403, 'ullccceey': 966452026,
                'irasubbotina_': 1180071373, 'Karina': 886155515, 'Максим': 1044869530, 'Дима': 1120695506,
                'Даша': 824548117, 'Анчоус 🥸': 744431052, 'Lolita': 1636551595, 'Зубкова Полина': 1535110493,
                'Яна Лукина': 800957236, 'Рената': 1652732836, 'Huge Cat': 1554349219, 'ксюша хлопова': 1866809913,
                'Polina Nosevich': 735035167, 'Voytenko': 895841296, 'Pyankova Polina': 941543842,
                'слава🤙': 1511045033, 'Kristina •••': 992489503, 'Алиса': 1503877841, 'Matias': 746600084,
                'Юля Арбузова': 1319044289, 'Диана Полянская': 827835673, 'gay': 1903810166, 'Карина': 811742362,
                'Валерия Гукова': 972919938, 'Antonina': 524027591, 'Александра Кузьменко 🤍': 1007940091,
                '🕊': 670243686, 'Анастасия Сеничкина': 1353175923, 'Katrine': 888661591,
                'Кристина makhoyni': 2128827002, 'Alina': 970537793, 'Peter Lagutin': 408444942,
                '☄ Asmodeus 🔱': 858518428, 'Anna Klimenteva': 911640801, 'Anastasia Millagher': 750119071,
                'Даниил Бердышев': 1112547975, 'Катя Сидорова': 1299812194, 'valerolll': 1329049699,
                'Svetlana': 293182379, 'Екатерина Боева': 1740178046, 'Денис Бирюков': 625991372,
                'Rrincess Bich': 1399973118, 'Биз': 1424975200, 'Phoenix’s': 597583721, 'Арсений Бирюков': 324242509,
                'ковальская-дефолтова': 575120780, 's o s': 608316796, 'анна семыкина': 1832602820,
                'ᯓ 𝑫𝑪 | 7𝗢𝗗𝗔✹ ⃝⃙🇲🇽': 1711263832, 'марияр': 920248300, 'даша про': 1037353382,
                'Ylik Zver🖇': 499606837, 'Ioann Chas': 175044465, 'Usman Mughal': 407274643,
                'Vladislav Kozub': 424185494, 'Михаил Лобынцев': 1125531055, 'Darya Sergeevna': 1070984836,
                '𝒦ℴ𝓉 ℳ𝒶𝓉𝓇ℴ𝓈𝓀𝒾𝓃😡ツ✘': 843464775, 'NVSPC ADMIN': 1854799789, 'Baxora': 913289451,
                'M.M.M': 500861553, 'Stepan Ikonnikov': 422419401, '.': 439481645, 'Аленка Токсик': 622051454,
                'leramalyy': 726058532, 'Кира': 1399417506, 'Dan Sazonov': 385056286}
    usernames = {'Ebanashk': 1306294714, 'aabuldakova': 626301983, 'kirkruglikov': 418107034,
                 'Shhiiiiiiiiitttt': 1242612463, 'qurbonov_gayrat': 763718623, 'shittt2': 1028047493,
                 'thevalllery': 984835432, 'sandra1089': 750857380, 'barkosser': 859499774, 'tylox01': 949449595,
                 'arishkaw': 915293518, 'allewgictopeople': 1839290151, 'alexselfish46': 830920118,
                 'mathfightsyandexru': 1339387850, 'kseniaklyueva': 808864993, 'aloapollinaria': 421770409,
                 'Not_puppy': 1371458078, 'rishbaranova': 925184312, 'katiamish': 966452026, 'tikitopersha': 744431052,
                 'polina_egf23': 1535110493, 'yanchous_lu': 800957236, 'Huge_Cat_exe': 1554349219, 'vo1ten': 895841296,
                 'ppyankova8': 941543842, 'voruvv1': 1511045033, 'Totehemolo': 746600084, 'diasha_mn': 827835673,
                 'karinamkr': 811742362, 'Lerochekcheese': 972919938, 'sssshhhhhiiiiiiittttt': 524027591,
                 'me_kuzmenko': 1007940091, 'kkseni_ks': 670243686, 'Anastasitit': 1353175923, 'Avi_katriin': 888661591,
                 'peterlagutin': 408444942, 'so_golden_28': 858518428, 'millagher': 750119071,
                 'DadyaDaniil': 1112547975, 'kAtyAAAaas': 1299812194, 'Svetlya4_ok': 293182379,
                 'Azizbek_Shavkatovich': 1424975200, 'olgoritms': 597583721, 'arseniy_biryukov': 324242509,
                 'u_kovaldefolt': 575120780, 'iammjulia': 608316796, 'STTT_4': 1711263832, 'lookwhatshed1d': 1037353382,
                 'Corzm13_18': 499606837, 'Van_che': 175044465, 'usmanmughal': 407274643, 'vykozub': 424185494,
                 'helloiameurofan': 1125531055, 'mishkaSao': 843464775, 'nvspc_admin': 1854799789,
                 'baxor1989': 913289451, 'vokinoki': 422419401, 'hdddkarina': 439481645, 'Alenkabrazhka': 622051454,
                 'leramalyy': 726058532, 'Kira_0014': 1399417506, 'dan_sazonov': 385056286}


find_users('')
