"""
Фичи общего назначения, которые не получилось запихнуть в другие файлы
"""

import os
import random
from collections import deque

import logger

log = logger.get_logger(__name__)


def get_memes() -> str:
    """
    Возвращает путь к рандомному мемасу из заранее отобранных, или пустую строку, если мемы не найдены

    :return: путь к пикче или пустая строка
    """
    if os.path.exists('./memes'):
        memes = list(filter(lambda x: x.endswith('.jpg'), os.listdir('./memes')))
    else:
        log.warning("Directory with memes (expected ./memes/) wasn't found")
        return ''

    if os.path.exists('./logs/log_memes.txt'):
        with open('./logs/log_memes.txt', 'r') as f:
            [last_meme] = deque(f, maxlen=1) or ['']
    else:
        last_meme = 0

    while True:
        output = random.choice(memes)
        if output != last_meme:
            with open('./logs/log_memes.txt', 'w+') as f:
                f.write(output)
            break

    return os.path.join('./memes', output)


def get_username(link: str) -> str:
    if link.startswith('@'):
        return link
    if link.startswith('http') or link.startswith('t.me'):
        return f'@{link.split("/")[-1]}'
    return ''


def find_users(name: str):
    full_names = {'ланских анна валерьевна': 1038986109, 'лопатко александр игоревич': 830920118,
                  'дьячкова елена михайловна': 684785002, 'борзенкова алина сергеевна': 1814854497,
                  'боева екатерина петровна': 1298918427, 'клюева ксения ивановна': 808864993,
                  'смольянинова полина олеговна': 421770409, 'сафатова ирина витальевна': 1371458078,
                  'мартыновой евгении  юрьевны': 1167059277, 'алфёров григорий александрович': 713815827,
                  'субботина ирина борисовна': 1180071373, 'костина карина романовна': 886155515,
                  'матвеев максим александрович': 1044869530, 'водолад дмитрий владиславович': 1120695506,
                  'шашкова дарья юрьевна': 824548117, 'казимирик анна дмитриевна': 744431052,
                  'подшибякина лолита николаевна': 1636551595, 'лукина яна евгеньевна': 800957236,
                  'камбарова рената наильевна': 1652732836, 'гонеев михаил сергеевич': 1554349219,
                  'носевич полина петровна': 735035167, 'войтенко владислав андреевич': 895841296,
                  'пьянкова полина андреевна': 941543842, 'солнцева ярославла андреевна': 1511045033,
                  'агибалова кристина станиславовна': 992489503, 'сасина алиса игоревна': 1503877841,
                  'полянская диана сергеевна': 827835673, 'макарьева карина алексеевна': 811742362,
                  'гукова валерия викторовна': 972919938, 'кузьменко александра александровна': 1007940091,
                  'галич ксения сергеевна': 670243686, 'сеничкина анастасия  александровна': 1353175923,
                  'таранова алина александровна': 970537793, 'климентьева анна дмитриевна': 911640801,
                  'тарасова анастасия владимировна': 750119071, 'бердышев даниил игоревич': 1112547975,
                  'сидорова екатерина евгеньевна': 1299812194, 'шевлякова валерия сергеевна': 1329049699,
                  'боева екатерина владимировна': 1740178046, 'бирюков денис александрович': 625991372,
                  'макаревич ирина сергеевна': 1399973118, 'ефремова мария романовна': 920248300,
                  'зверева юлия евгеньевна': 499606837, 'часовских иван александрович': 175044465,
                  'баулина дарья сергеевна': 1070984836, 'бражникова елена александровна': 622051454,
                  'малыхина валерия юрьевна': 726058532, 'сазонов даниил александрович': 385056286}
    tg_names = {'~твоя мерзость.': 1306294714, 'арсений': 912515292, 'екатерина гребёнкина': 1202704228,
                'александра': 626301983, 'кирилл кругликов': 418107034, 'kerauverk': 1242612463,
                'nikki vskrto': 1827430974, "g'ayrat": 763718623, 'маруся дощечкина': 1028047493,
                '🤍thevalery🤍': 984835432, 'sasha': 750857380, 'barkosser': 859499774, '🐿️': 949449595,
                'arisha kopylova': 915293518, 'матвей янголенко': 604181224, 'allergic to people': 1839290151,
                'анна ланских': 1038986109, 'aleksandr lopatko': 830920118, 'lena d': 684785002, 'алина☃️': 1814854497,
                'софья пошукайло': 1339387850, 'катя боева': 1298918427, 'ксения клюева': 808864993,
                'аполлинария': 421770409, 'ира': 1371458078, 'evgeha': 1167059277, 'роман комов': 476337160,
                'rish': 925184312, 'гриша алфёров': 713815827, 'никошка': 1276954403, 'ullccceey': 966452026,
                'irasubbotina_': 1180071373, 'karina': 886155515, 'максим': 1044869530, 'дима': 1120695506,
                'даша': 824548117, 'анчоус 🥸': 744431052, 'lolita': 1636551595, 'зубкова полина': 1535110493,
                'яна лукина': 800957236, 'рената': 1652732836, 'huge cat': 1554349219, 'ксюша хлопова': 1866809913,
                'polina nosevich': 735035167, 'voytenko': 895841296, 'pyankova polina': 941543842,
                'слава🤙': 1511045033, 'kristina •••': 992489503, 'алиса': 1503877841, 'matias': 746600084,
                'юля арбузова': 1319044289, 'диана полянская': 827835673, 'gay': 1903810166, 'карина': 811742362,
                'валерия гукова': 972919938, 'antonina': 524027591, 'александра кузьменко 🤍': 1007940091,
                '🕊': 670243686, 'анастасия сеничкина': 1353175923, 'katrine': 888661591,
                'кристина makhoyni': 2128827002, 'alina': 970537793, 'peter lagutin': 408444942,
                '☄ asmodeus 🔱': 858518428, 'anna klimenteva': 911640801, 'anastasia millagher': 750119071,
                'даниил бердышев': 1112547975, 'катя сидорова': 1299812194, 'valerolll': 1329049699,
                'svetlana': 293182379, 'екатерина боева': 1740178046, 'денис бирюков': 625991372,
                'rrincess bich': 1399973118, 'биз': 1424975200, 'phoenix’s': 597583721, 'арсений бирюков': 324242509,
                'ковальская-дефолтова': 575120780, 's o s': 608316796, 'анна семыкина': 1832602820,
                'ᯓ 𝑫𝑪 | 7𝗢𝗗𝗔✹ ⃝⃙🇲🇽': 1711263832, 'марияр': 920248300, 'даша про': 1037353382,
                'ylik zver🖇': 499606837, 'ioann chas': 175044465, 'usman mughal': 407274643,
                'vladislav kozub': 424185494, 'михаил лобынцев': 1125531055, 'darya sergeevna': 1070984836,
                '𝒦ℴ𝓉 ℳ𝒶𝓉𝓇ℴ𝓈𝓀𝒾𝓃😡ツ✘': 843464775, 'nvspc admin': 1854799789, 'baxora': 913289451,
                'm.m.m': 500861553, 'stepan ikonnikov': 422419401, '.': 439481645, 'аленка токсик': 622051454,
                'leramalyy': 726058532, 'кира': 1399417506, 'dan sazonov': 385056286}
    usernames = {'ebanashk': 1306294714, 'aabuldakova': 626301983, 'kirkruglikov': 418107034,
                 'shhiiiiiiiiitttt': 1242612463, 'qurbonov_gayrat': 763718623, 'shittt2': 1028047493,
                 'thevalllery': 984835432, 'sandra1089': 750857380, 'barkosser': 859499774, 'tylox01': 949449595,
                 'arishkaw': 915293518, 'allewgictopeople': 1839290151, 'alexselfish46': 830920118,
                 'mathfightsyandexru': 1339387850, 'kseniaklyueva': 808864993, 'aloapollinaria': 421770409,
                 'not_puppy': 1371458078, 'rishbaranova': 925184312, 'katiamish': 966452026, 'tikitopersha': 744431052,
                 'polina_egf23': 1535110493, 'yanchous_lu': 800957236, 'huge_cat_exe': 1554349219, 'vo1ten': 895841296,
                 'ppyankova8': 941543842, 'voruvv1': 1511045033, 'totehemolo': 746600084, 'diasha_mn': 827835673,
                 'karinamkr': 811742362, 'lerochekcheese': 972919938, 'sssshhhhhiiiiiiittttt': 524027591,
                 'me_kuzmenko': 1007940091, 'kkseni_ks': 670243686, 'anastasitit': 1353175923, 'avi_katriin': 888661591,
                 'peterlagutin': 408444942, 'so_golden_28': 858518428, 'millagher': 750119071,
                 'dadyadaniil': 1112547975, 'katyaaaaas': 1299812194, 'svetlya4_ok': 293182379,
                 'azizbek_shavkatovich': 1424975200, 'olgoritms': 597583721, 'arseniy_biryukov': 324242509,
                 'u_kovaldefolt': 575120780, 'iammjulia': 608316796, 'sttt_4': 1711263832, 'lookwhatshed1d': 1037353382,
                 'corzm13_18': 499606837, 'van_che': 175044465, 'usmanmughal': 407274643, 'vykozub': 424185494,
                 'helloiameurofan': 1125531055, 'mishkasao': 843464775, 'nvspc_admin': 1854799789,
                 'baxor1989': 913289451, 'vokinoki': 422419401, 'hdddkarina': 439481645, 'alenkabrazhka': 622051454,
                 'leramalyy': 726058532, 'kira_0014': 1399417506, 'dan_sazonov': 385056286}

    short_names = {'саша': 'александра', 'лёша': 'алексей', 'алик': 'альберт', 'толя': 'анатолий', 'андрей': 'андрей',
                   'антон': 'антон', 'аркаша': 'аркадий', 'сеня': 'арсений', 'тёма': 'артём', 'артур': 'артур',
                   'богдан': 'богдан', 'боря': 'борис', 'вадик': 'вадим', 'валя': 'валентина', 'валера': 'валерий',
                   'вася': 'василий', 'веня': 'вениамин', 'витя': 'виктор', 'виталик': 'виталий', 'виталя': 'виталий',
                   'володя': 'владимир', 'вова': 'владимир', 'влад': 'владислав', 'слава': 'ярослав',
                   'сева': 'всеволод', 'гена': 'геннадий', 'гоша': 'георгий', 'жора': 'георгий', 'глеб': 'глеб',
                   'гриша': 'григорий', 'даня': 'даниил', 'денис': 'денис', 'дима': 'дмитрий', 'женя': 'евгения',
                   'егор': 'егор', 'фима': 'ефим', 'ваня': 'иван', 'игорь': 'игорь', 'илья': 'илья', 'кирилл': 'кирилл',
                   'костя': 'константин', 'лёва': 'лев', 'лёня': 'леонид', 'леоня': 'леонтий', 'максим': 'максим',
                   'марат': 'марат', 'матвей': 'матвей', 'миша': 'михаил', 'никита': 'никита', 'коля': 'николай',
                   'олег': 'олег', 'паша': 'павел', 'петя': 'пётр', 'рома': 'роман', 'ростя': 'ростислав',
                   'руслан': 'руслан', 'сёма': 'семён', 'серёжа': 'сергей', 'стас': 'станислав', 'стёпа': 'степан',
                   'тима': 'тимофей', 'федя': 'фёдор', 'филя': 'филипп', 'эдик': 'эдуард', 'юра': 'юрий', 'ян': 'ян',
                   'ярик': 'ярослав', 'аля': 'алевтина', 'алёна': 'алёна', 'алина': 'алина', 'алиса': 'алиса',
                   'алла': 'алла', 'настя': 'анастасия', 'геля': 'ангелина', 'анжела': 'анжелика', 'аня': 'анна',
                   'тоня': 'антонина', 'лера': 'валерия', 'варя': 'варвара', 'венера': 'венера', 'вера': 'вера',
                   'вероника': 'вероника', 'вика': 'виктория', 'галя': 'галина', 'гуля': 'гульнара', 'даша': 'дарья',
                   'диана': 'диана', 'дуся': 'евдокия', 'катя': 'екатерина', 'лена': 'елена', 'лиза': 'елизавета',
                   'жанна': 'жанна', 'зина': 'зинаида', 'зоя': 'зоя', 'инна': 'инна', 'ира': 'ирина',
                   'карина': 'карина', 'кира': 'кира', 'клава': 'клавдия', 'клара': 'клара', 'кристина': 'кристина',
                   'ксюша': 'ксения', 'лара': 'лариса', 'лида': 'лидия', 'луиза': 'луиза', 'люба': 'любовь',
                   'люда': 'людмила', 'мила': 'людмила', 'мальвина': 'мальвина', 'рита': 'маргарита', 'маша': 'мария',
                   'марина': 'марина', 'милена': 'милена', 'надя': 'надежда', 'наташа': 'наталья', 'нина': 'нина',
                   'оксана': 'оксана', 'олеся': 'олеся', 'оля': 'ольга', 'полина': 'полина', 'рая': 'раиса',
                   'регина': 'регина', 'света': 'светлана', 'соня': 'софья', 'тома': 'тамара', 'таня': 'татьяна',
                   'уля': 'ульяна', 'эля': 'эльвира', 'юля': 'юлия', 'яна': 'яна'}
